---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.UnitWeight
source: html/6050f11e-2c0e-8be0-6b4f-18703509afa0.htm
---
# Autodesk.Revit.DB.SpecTypeId.UnitWeight Property

Unit Weight, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId UnitWeight { get; }
```